code-review/NRB_3471_3546/База_Было/InformationRegisters/ДанныеИзDiasoft.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИзDiasoft</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументЗагрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДанныеИзDiasoft</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДокументаDiasoft</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВидаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидСуммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДокументаDiasoft</Name>
					<Comment>Номер документа Diasoft в формате НомерПачки/НомерСамогоДокумента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДДокументаDiasoft</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВидыДанныхИзDiasoft.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДанныхИзDiasoft</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоходыИРасходыОтносящиесяКДепозитарнойДеятельности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВидСуммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидСуммы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоходыПоКомиссииЗаДепозитарнуюДеятельность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаКомиссииЗаДепозитарнуюДеятельность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ДанныеИзDiasoft.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДанныеИзDiasoft</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДанныхИзDiasoft</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/ПолучениеДанныхДиасофтВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает запись в регистре ЖурналИсходящихСообщенийKafka содержащую запрос к Диасофт
// на получение данных для отчетности
// Параметры:
//	ДатаЗапроса - Дата - дата в котрую выполняется запрос (как правило, текущая);
Процедура СоздатьЗапросДанных(ДатаЗапроса) Экспорт
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaMultiToDiasRequestData1655;
	УИДСообщения = Строка(Новый УникальныйИдентификатор());
	
	Ключ = "Request";
	ТекстJSON = СформироватьТекстЗапросаJSON(УИДСообщения, ДатаЗапроса);
	Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, Ключ, ТекстJSON, УИДСообщения);
КонецПроцедуры

// Ищет и обрабатывает запись в регистре ЖурналИсходящихСообщенийKafka содержащую данные
// из Диасофт, а именно создает документ ДанныеИзДиасофт и Связанные с ним записи в РС
// ДанныеИзДиасофт
Процедура ОбработатьОтветы() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналВходящихСообщенийKafka.ВнешнийИсточник КАК ВнешнийИсточник,
	|	ЖурналВходящихСообщенийKafka.Ключ КАК Ключ,
	|	ЖурналВходящихСообщенийKafka.Идентификатор КАК Идентификатор,
	|	ЖурналВходящихСообщенийKafka.Сообщение КАК Сообщение,
	|	ЖурналВходящихСообщенийKafka.ОшибкаОбработки КАК ОшибкаОбработки,
	|	ЖурналВходящихСообщенийKafka.ОписаниеОшибки КАК ОписаниеОшибки,
	|	ЖурналВходящихСообщенийKafka.ПериодСообщения КАК ПериодСообщения,
	|	ЖурналВходящихСообщенийKafka.ПериодОбработкиСообщения КАК ПериодОбработкиСообщения
	|ИЗ
	|	РегистрСведений.ЖурналВходящихСообщенийKafka КАК ЖурналВходящихСообщенийKafka
	|ГДЕ
	|	ЖурналВходящихСообщенийKafka.ВнешнийИсточник = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВнешниеИсточники.KafkaDiasToDepoDocSum1655)
	|	И ЖурналВходящихСообщенийKafka.Ключ = ""DocumentsSumDias""
	|	И НЕ ЖурналВходящихСообщенийKafka.Обработан";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработатьОдноВходящееСообщение(Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТекстЗапросаJSON(УИДСообщения, ДатаЗапроса)
	MessageInfo = РаботаСJSON.СтруктураMessageInfo();
	MessageInfo.MessageType = "Request";
	MessageInfo.JsonVersion = "1.0.0";
	MessageInfo.MessageId = УИДСообщения;
	MessageInfo.SystemSource = "Depo";
	MessageInfo.ActionType = "GET";
	MessageInfo.MasterMessageId = УИДСообщения;
	MessageInfo.ParentMessageId = Неопределено;
	MessageInfo.DateTimeCreate = ЗаписатьДатуJSON(ТекущаяДатаСеанса(), ФорматДатыJSON.ISO);
	
	Data = Новый Структура;
	Data.Вставить("RequestType", "DocumentsSumDias");
	Data.Вставить("RequestSystem", "Dias");
	// Если задание запускается в январе, то DateStart - первая дата предыдущего года, иначе
	// первая датой текущего года, DateEnd - Последняя дата предыдущего месяца.
	DateEnd = НачалоДня(НачалоМесяца(ДатаЗапроса) - 1);
	DateStart = НачалоМесяца(DateEnd);
	Data.Вставить("DateStart", ЗаписатьДатуJSON(DateStart, ФорматДатыJSON.ISO) );
	Data.Вставить("DateEnd", ЗаписатьДатуJSON(DateEnd, ФорматДатыJSON.ISO) );
	
	ТекстЗапросаJSON = РаботаСJSON.ТекстСообщенияJSON(MessageInfo, Data);
	
	Возврат ТекстЗапросаJSON;
КонецФункции

Процедура ОбработатьОдноВходящееСообщение(Выборка)
	ТекДата = ТекущаяДатаСеанса();
	ОписаниеОшибки = "";
	ИмяСобытия = "Загрузка данных для отчетности из ИзDiasoft";
	
	СтруктураИзJSON = РаботаСJSON.РезультатЧтенияJSON(Выборка.Сообщение);
	Если ОбязательныеПоляВНаличии(СтруктураИзJSON, ОписаниеОшибки) Тогда
		НачатьТранзакцию();
		Попытка
			ЗаписатьВБазуДанныеИзDiasoft(Выборка.Идентификатор, СтруктураИзJSON, ОписаниеОшибки);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	Запись = РегистрыСведений.ЖурналВходящихСообщенийKafka.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Запись.Обработан = Истина;
	Запись.ОшибкаОбработки = Не ПустаяСтрока(ОписаниеОшибки);
	Если Запись.ОшибкаОбработки Тогда
		Запись.ОписаниеОшибки = ОписаниеОшибки;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	КонецЕсли;
	Запись.ПериодОбработкиСообщения = ТекДата;
	Запись.Записать(Истина);
КонецПроцедуры

Функция ОбязательныеПоляВНаличии(СтруктураИзJSON, ОписаниеОшибки)
	ПроверятьЗаполненность = Ложь;
	СписокПолейСтрокой = "MessageInfo,Data";
	РаботаСJSON.ПроверитьОбязательныеПоля(СтруктураИзJSON, СписокПолейСтрокой, ОписаниеОшибки, ПроверятьЗаполненность);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверятьЗаполненность = Истина;
	СписокПолейСтрокой = "MessageId";
	РаботаСJSON.ПроверитьОбязательныеПоля(СтруктураИзJSON.MessageInfo, СписокПолейСтрокой, ОписаниеОшибки, ПроверятьЗаполненность);
	СписокПолейСтрокой = "DateStart,DateEnd,Documents";
	РаботаСJSON.ПроверитьОбязательныеПоля(СтруктураИзJSON.Data, СписокПолейСтрокой, ОписаниеОшибки, ПроверятьЗаполненность);
	
	Возврат ПустаяСтрока(ОписаниеОшибки);
КонецФункции

Процедура ЗаписатьВБазуДанныеИзDiasoft(Идентификатор, СтруктураИзJSON, ОписаниеОшибки)
	Если УжеЗагруженоЭтоСообщениеСДаннымиИзDiasoft(Идентификатор) Тогда
		ОписаниеОшибки = "Сообщение с идентификатором " + Идентификатор + " уже было загружено ранее";
		Возврат;
	КонецЕсли;
	ДокументДанныеИзDiasoft = НовыйДокументДанныеИзDiasoft(Идентификатор, СтруктураИзJSON.Data);
	СоздатьЗаписиВРегистреДанныеИзDiasoft(ДокументДанныеИзDiasoft, СтруктураИзJSON.Data.Documents, ОписаниеОшибки);
КонецПроцедуры

Функция НовыйДокументДанныеИзDiasoft(Идентификатор, Data)
	НовыйДокумент = Документы.ДанныеИзDiasoft.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.НачалоПериода = ПрочитатьДатуJSON(Data.DateStart, ФорматДатыJSON.ISO);
	НовыйДокумент.КонецПериода = ПрочитатьДатуJSON(Data.DateEnd, ФорматДатыJSON.ISO);
	НовыйДокумент.ВидДанных = Перечисления.ВидыДанныхИзDiasoft.ДоходыИРасходыОтносящиесяКДепозитарнойДеятельности;
	НовыйДокумент.ИдентификаторСообщения = Идентификатор;
	НовыйДокумент.Записать();
	
	Возврат НовыйДокумент.Ссылка;
КонецФункции

Процедура СоздатьЗаписиВРегистреДанныеИзDiasoft(ДокументДанныеИзDiasoft, Documents, ОписаниеОшибки)
	Если Documents.Количество() = 0 Тогда
		ОписаниеОшибки = "В сообщении нет информации ни об одном документе Diasoft (массив Documents пуст).";
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДанныеИзDiasoft.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументЗагрузки.Установить(ДокументДанныеИзDiasoft);
	ПроверятьЗаполненность = Истина;
	СписокПолейСтрокой = "Date,OperationTypeCode,SumTypeCode,Batch,Number,DiasId,Sum";
	Для каждого ДокументDiasoft Из Documents Цикл
		РаботаСJSON.ПроверитьОбязательныеПоля(ДокументDiasoft, СписокПолейСтрокой, ОписаниеОшибки, ПроверятьЗаполненность);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			Прервать;
		Иначе
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ДокументЗагрузки = ДокументДанныеИзDiasoft;
			НоваяЗапись.ДатаДокументаDiasoft = ПрочитатьДатуJSON(ДокументDiasoft.Date, ФорматДатыJSON.ISO);
			НоваяЗапись.КодВидаОперации = ДокументDiasoft.OperationTypeCode;
			НоваяЗапись.ВидСуммы = ВидСуммыПоКодуВидаСуммы(ДокументDiasoft, ОписаниеОшибки);
			НоваяЗапись.НомерДокументаDiasoft = ДокументDiasoft.Batch + "/" + ДокументDiasoft.Number;
			НоваяЗапись.ИДДокументаDiasoft = ДокументDiasoft.DiasId;
			НоваяЗапись.Сумма = ДокументDiasoft.Sum;
		КонецЕсли;
	КонецЦикла;
	Если ПустаяСтрока(ОписаниеОшибки) Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

Функция УжеЗагруженоЭтоСообщениеСДаннымиИзDiasoft(Идентификатор)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Истина КАК ДокументНайден
	|ИЗ
	|	Документ.ДанныеИзDiasoft КАК ДанныеИзDiasoft
	|ГДЕ
	|	ДанныеИзDiasoft.ИдентификаторСообщения = &Идентификатор
	|	И НЕ ДанныеИзDiasoft.ПометкаУдаления";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	УжеЗагруженоЭтоСообщение = НЕ Запрос.Выполнить().Пустой();
	
	Возврат УжеЗагруженоЭтоСообщение;
КонецФункции

Функция ВидСуммыПоКодуВидаСуммы(ДокументDiasoft, ОписаниеОшибки)
	ВидСуммы = Неопределено;
	
	Если ДокументDiasoft.SumTypeCode = "INC" Тогда
		ВидСуммы = Перечисления.ВидСуммы.ДоходыПоКомиссииЗаДепозитарнуюДеятельность;
	ИначеЕсли ДокументDiasoft.SumTypeCode = "EXP" Тогда
		ВидСуммы = Перечисления.ВидСуммы.РасходыНаКомиссииЗаДепозитарнуюДеятельность;
	Иначе
		ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
						+ "Не предусмотренный код вида суммы: """ + ДокументDiasoft.SumTypeCode + """ "
						+ "у документа Diasoft " + ДокументDiasoft.Number + " от " + ДокументDiasoft.Date;
	КонецЕсли;
	
	Возврат ВидСуммы;
КонецФункции

#КонецОбласти
